package org.example_1.hw_8;

/* Создать класс Person с полями Имя, фамилия, год рождения, пол (два варианта - мужской и женский),
семейный статус (singe/married). Используйте знания с лекции 8 при дизайне.

Создайте класс, в котором создайте объект класса Pesron. Если человек старше 18 и single, предложите ему услуги своего сайта знакомств:
"Уважаемый Павел, желаете ли познакомится с девушкой?" или "Уважаемая Светлана, мы поможем вам найти мужчину мечты!"

Создайте еще один класс, в котором создайте массив Person, и сделайте для них все то же самое.

 */

public class Person {
    public static void main(String[] args) {

    }
}
